# ✅ Task 1: Basic Data Inspection

## a.) Load both train.csv and test.csv into separate DataFrames.

In [7]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

df1 = pd.read_csv("test.csv")
df2 = pd.read_csv("train.csv")

b.) Print the shape, columns, and first few rows of each.

In [8]:
df1.shape

(418, 11)

In [9]:
df2.shape

(891, 12)

In [14]:
df1.columns

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [15]:
df2.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [10]:
df1.head(4)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S

In [11]:
df2.head(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

# ✅ Task 2: Missing Value Detection

## a.) Check how many missing values are there in each column.

In [ ]:
df1.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [19]:
df2.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

## b.) Print rows that have missing values.

In [24]:
df1.isna().any(axis=0)

PassengerId    False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare            True
Cabin           True
Embarked       False
dtype: bool

In [25]:
df2.isna().any(axis=0)

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

# ✅ Task 3: Value Counts & Grouping

## a.) Pick a categorical column (like Sex, Embarked, or similar) and show how many unique values it has.

In [37]:
df1["Sex"].unique()

array(['male', 'female'], dtype=object)

In [40]:
df2["Embarked"].unique()

array(['S', 'C', 'Q', nan], dtype=object)

## b.) Group the dataset based on one of those values and find the average of a numerical column (like Age, Fare).

In [43]:
df1["Age"].fillna(df1["Age"].mean( ),inplace= True)

C:\Users\CHEF Jupalli\AppData\Local\Temp\ipykernel_1484\739269221.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df1["Age"].fillna(df1["Age"].mean( ),inplace= True)

In [44]:
df1["Age"].isna().sum(axis=0)

np.int64(0)

In [48]:
df1["Age"].head()

0    34.5
1    47.0
2    62.0
3    27.0
4    22.0
Name: Age, dtype: float64

In [49]:
df2["Age"].isna().sum(axis=0)

np.int64(177)

In [57]:
df2["Age"].fillna(df2["Age"].mean(), inplace=True)

C:\Users\CHEF Jupalli\AppData\Local\Temp\ipykernel_1484\3743866213.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df2["Age"].fillna(df2["Age"].mean(), inplace=True)

In [59]:
df2["Age"].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [58]:
df2["Age"].isna().sum(axis=0)

np.int64(0)

In [65]:
combinedAge_df = pd.concat([df1["Age"], df2["Age"]])

In [70]:
combinedAge_df.head()

0    34.5
1    47.0
2    62.0
3    27.0
4    22.0
Name: Age, dtype: float64

In [69]:
combinedAge_df.describe()

count    1309.000000
mean       29.882243
std        12.883758
min         0.170000
25%        22.000000
50%        29.699118
75%        35.000000
max        80.000000
Name: Age, dtype: float64